aidangarske/wolfssl-examples-stm32/STM32_Bare_Test/src/main_cbonly.c
/* main_cbonly.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * Crypto-callback-only test app for STM32_Bare_Test. Runs the four primitives
 * an embedded TLS/secure-boot stack needs -- ECDSA (sign/verify), AES-GCM
 * (full payload), HMAC-SHA256 and TRNG -- entirely on hardware through the
 * wolfCrypt crypto-callback framework (the STM32 DHUK device, see
 * wc_Stm32_DhukRegister). Built with the STM32_BARE_CB_ONLY preset, the
 * software crypto is stripped so flash shrinks; the primitives run on the
 * SAES / PKA / HASH / RNG blocks with keys that never enter software.
 *
 *   [1] ECDSA sign via a DHUK-wrapped scalar (PKA), verified with the public
 *       key. Asserts dhuk_is_ccb on a CCB build (no software keygen fallback).
 *   [2] AES-GCM full payload via the DHUK device: encrypt -> decrypt round-trip
 *       recovers the plaintext and verifies the tag; a tampered tag is rejected
 *       (AES_GCM_AUTH_E). Exercises the SAES CTR + GHASH path.
 *   [3] HMAC-SHA256 via a DHUK-devId Hmac (STM32 HASH block), matched against
 *       the RFC 4231 test-case-1 vector.
 *   [4] TRNG via a DHUK-devId RNG (STM32 hardware RNG through the callback).
 *
 * A backend that is gated off or cannot complete on TZEN=0 silicon
 * (CRYPTOCB_UNAVAILABLE / a secure-context timeout) is reported as an expected
 * soft-PASS for the asymmetric legs, not a failure. Build with:
 *   make BOARD=u3 CONFIG=bare TARGET=cbonly
 */

#include <stdio.h>

#include "board.h"

extern uint32_t SystemCoreClock;
extern void     SystemCoreClockUpdate(void);

#include "wolfssl/wolfcrypt/settings.h"
#include "wolfssl/version.h"
#include "wolfssl/wolfcrypt/types.h"
#include "wolfssl/wolfcrypt/wc_port.h"
#include "wolfssl/wolfcrypt/error-crypt.h"
#include "wolfssl/wolfcrypt/random.h"
#include "wolfssl/wolfcrypt/ecc.h"
#include "wolfssl/wolfcrypt/aes.h"
#include "wolfssl/wolfcrypt/hmac.h"
#include "wolfssl/wolfcrypt/port/st/stm32.h"

#ifndef BUILD_CONFIG_NAME
#define BUILD_CONFIG_NAME "unknown"
#endif

/* Debugger-readable result sink (magic 0xCB010001 once main() completes), so
 * results can be captured without a working VCP. Read after the run with:
 *   arm-none-eabi-nm app.elf | grep g_cbonly_res   # address
 *   openocd ... -c "mdw 0x<addr> 6"                                        */
volatile struct {
    uint32_t magic;
    int32_t  ecdsa_rc;
    int32_t  gcm_rc;
    int32_t  hmac_rc;
    int32_t  rng_rc;
    int32_t  overall;
} g_cbonly_res;

/* A backend gated off or unable to complete the unwrap on TZEN=0 silicon
 * returns one of these. Treat as expected for the asymmetric legs. */
static int is_expected_gated(int ret)
{
    return (ret == CRYPTOCB_UNAVAILABLE) ||
           (ret == WC_TIMEOUT_E) ||
           (ret == WC_HW_E);
}

#if defined(WOLFSSL_DHUK) && \
    (defined(WOLFSSL_STM32_BARE) || defined(WOLFSSL_STM32_CUBEMX)) && \
    defined(WC_STM32_HAS_DHUK) && defined(WOLF_CRYPTO_CB)

/* Shared 256-bit derivation seed (used as the "key" for the DHUK device on the
 * symmetric legs). The SAES-derived working key never appears in software. */
static const byte g_seed[32] = {
    0x00,0x11,0x22,0x33,0x44,0x55,0x66,0x77,
    0x88,0x99,0xaa,0xbb,0xcc,0xdd,0xee,0xff,
    0x10,0x32,0x54,0x76,0x98,0xba,0xdc,0xfe,
    0xef,0xcd,0xab,0x89,0x67,0x45,0x23,0x01
};

#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
/* [1] ECDSA sign via a DHUK-protected private key, verified with the public
 * counterpart. Mirrors the transparent DHUK sign path: make a P-256 keypair,
 * wrap its scalar with the DHUK-derived key, import the wrapped scalar + seed,
 * route signing through the device, then verify. */
static int test_cbonly_ecdsa(WC_RNG* rng)
{
    static const byte hash[32] = {
        0x9f,0x86,0xd0,0x81,0x88,0x4c,0x7d,0x65,
        0x9a,0x2f,0xea,0xa0,0xc5,0x5a,0xd0,0x15,
        0xa3,0xbf,0x4f,0x1b,0x2b,0x0b,0x82,0x2c,
        0xd1,0x5d,0x6c,0x15,0xb0,0xf0,0x0a,0x08
    };
    ecc_key kp;
    Aes     aes;
    byte    priv[32];
    byte    wrapped[32];
    byte    sig[80];
    word32  privSz = (word32)sizeof(priv);
    word32  sigLen = (word32)sizeof(sig);
    int     ret;
    int     verify = 0;
    int     haveKey = 0;

    ret = wc_ecc_init(&kp);
    if (ret != 0) {
        printf("  wc_ecc_init failed: %d\n", ret);
        return ret;
    }
    haveKey = 1;

    ret = wc_ecc_make_key_ex(rng, 32, &kp, ECC_SECP256R1);
    if (ret != 0) {
        printf("  wc_ecc_make_key_ex failed: %d\n", ret);
        goto cleanup;
    }
#ifdef WOLFSSL_STM32_CCB
    /* On a CCB build the callback binds a hardware-protected blob during
     * keygen; require it so a silent software-keygen fallback fails the test. */
    if (kp.dhuk_is_ccb != 1) {
        printf("  ERROR: CCB fell back to software keygen (dhuk_is_ccb=%d)\n",
               kp.dhuk_is_ccb);
        ret = -1;
        goto cleanup;
    }
#endif

    ret = wc_ecc_export_private_only(&kp, priv, &privSz);
    if (ret != 0 || privSz != 32u) {
        printf("  export scalar failed: %d (len %lu)\n", ret,
               (unsigned long)privSz);
        ret = (ret != 0) ? ret : -1;
        goto cleanup;
    }

    /* Wrap the scalar = ECB-encrypt with the DHUK-derived key (seed as key). */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesSetKey(&aes, g_seed, 32, NULL, AES_ENCRYPTION);
    }
    if (ret == 0) {
        ret = wc_AesEcbEncrypt(&aes, wrapped, priv, 32);
    }
    wc_AesFree(&aes);
    wc_ForceZero(priv, sizeof(priv));
    if (is_expected_gated(ret)) {
        printf("  ECDSA: DHUK backend gated/unavailable (ret=%d) -- soft PASS\n",
               ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  scalar wrap failed: %d\n", ret);
        goto cleanup;
    }

    kp.devId = WC_DHUK_DEVID;
    ret = wc_ecc_import_wrapped_private(&kp, g_seed, (word32)sizeof(g_seed),
                                        wrapped, 32, 32);
    if (ret != 0) {
        printf("  import wrapped private failed: %d\n", ret);
        goto cleanup;
    }

    ret = wc_ecc_sign_hash(hash, (word32)sizeof(hash), sig, &sigLen, rng, &kp);
    if (is_expected_gated(ret)) {
        printf("  ECDSA sign gated/unavailable (ret=%d) -- soft PASS\n", ret);
        ret = 0;
        goto cleanup;
    }
    if (ret != 0) {
        printf("  ECDSA sign failed: %d\n", ret);
        goto cleanup;
    }

    ret = wc_ecc_verify_hash(sig, sigLen, hash, (word32)sizeof(hash),
                             &verify, &kp);
    if (ret != 0) {
        printf("  ECDSA verify error: %d\n", ret);
        goto cleanup;
    }
    if (verify != 1) {
        printf("  ECDSA verify FAILED (sig invalid)\n");
        ret = -1;
        goto cleanup;
    }
    printf("  ECDSA sign(DHUK)+verify OK (%lu-byte sig)\n",
           (unsigned long)sigLen);
    ret = 0;

cleanup:
    wc_ForceZero(priv, sizeof(priv));
    wc_ForceZero(wrapped, sizeof(wrapped));
    if (haveKey) {
        wc_ecc_free(&kp);
    }
    return ret;
}
#endif /* HAVE_ECC && WOLFSSL_STM32_PKA */

#ifdef HAVE_AESGCM
/* [2] AES-GCM with a full (nonzero) payload via the DHUK device. Encrypt then
 * decrypt: the round-trip must recover the plaintext and verify the tag, the
 * ciphertext must differ from the plaintext, and a tampered tag must be
 * rejected. Exercises the SAES CTR keystream + software GHASH path. */
static int test_cbonly_gcm(void)
{
    static const byte iv[12] = {
        0xca,0xfe,0xba,0xbe,0xfa,0xce,0xdb,0xad,
        0xde,0xca,0xf8,0x88
    };
    static const byte aad[16] = {
        0xfe,0xed,0xfa,0xce,0xde,0xad,0xbe,0xef,
        0xfe,0xed,0xfa,0xce,0xde,0xad,0xbe,0xef
    };
    /* 20 bytes -> one full block + a 4-byte partial, to cover the trailing
     * partial-block path. */
    static const byte pt[20] = {
        0xd9,0x31,0x32,0x25,0xf8,0x84,0x06,0xe5,
        0xa5,0x59,0x09,0xc5,0xaf,0xf5,0x26,0x9a,
        0x86,0xa7,0xa9,0x53
    };
    Aes    aes;
    byte   ct[20];
    byte   rt[20];
    byte   tag[16];
    int    ret;
    int    i;

    XMEMSET(ct, 0, sizeof(ct));
    XMEMSET(rt, 0, sizeof(rt));
    XMEMSET(tag, 0, sizeof(tag));

    /* Encrypt. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, g_seed, (word32)sizeof(g_seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmEncrypt(&aes, ct, pt, (word32)sizeof(pt),
                               iv, (word32)sizeof(iv),
                               tag, (word32)sizeof(tag),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    if (is_expected_gated(ret)) {
        printf("  GCM: DHUK backend gated/unavailable (ret=%d) -- soft PASS\n",
               ret);
        return 0;
    }
    if (ret != 0) {
        printf("  GCM encrypt failed: %d\n", ret);
        return ret;
    }
    if (XMEMCMP(pt, ct, sizeof(pt)) == 0) {
        printf("  GCM produced plaintext -- FAIL\n");
        return -1;
    }
    printf("  GCM ct:");
    for (i = 0; i < (int)sizeof(ct); i++) printf(" %02x", ct[i]);
    printf("\n  GCM tag:");
    for (i = 0; i < (int)sizeof(tag); i++) printf(" %02x", tag[i]);
    printf("\n");

    /* Decrypt + verify tag -- must recover the plaintext. */
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, g_seed, (word32)sizeof(g_seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmDecrypt(&aes, rt, ct, (word32)sizeof(ct),
                               iv, (word32)sizeof(iv),
                               tag, (word32)sizeof(tag),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    if (ret != 0) {
        printf("  GCM decrypt/verify failed: %d\n", ret);
        return ret;
    }
    if (XMEMCMP(pt, rt, sizeof(pt)) != 0) {
        printf("  GCM round-trip mismatch -- FAIL\n");
        return -1;
    }
    printf("  GCM round-trip OK (plaintext recovered, tag verified)\n");

    /* Negative: a tampered tag must be rejected. */
    tag[0] ^= 0xff;
    ret = wc_AesInit(&aes, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_AesGcmSetKey(&aes, g_seed, (word32)sizeof(g_seed));
    }
    if (ret == 0) {
        ret = wc_AesGcmDecrypt(&aes, rt, ct, (word32)sizeof(ct),
                               iv, (word32)sizeof(iv),
                               tag, (word32)sizeof(tag),
                               aad, (word32)sizeof(aad));
    }
    wc_AesFree(&aes);
    if (ret != AES_GCM_AUTH_E) {
        printf("  GCM tamper NOT rejected (ret=%d) -- FAIL\n", ret);
        return -1;
    }
    printf("  GCM tamper rejected (AES_GCM_AUTH_E) OK\n");
    return 0;
}
#endif /* HAVE_AESGCM */

#ifndef NO_HMAC
/* [3] HMAC-SHA256 via a DHUK-devId Hmac. hmac.c routes this to the STM32 HASH
 * block (the callback declines HMAC; the HW innerHashKeyed path runs). Matched
 * against RFC 4231 test case 1. */
static int test_cbonly_hmac(void)
{
    static const byte key[20] = {
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,
        0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,0x0b,
        0x0b,0x0b,0x0b,0x0b
    };
    static const byte data[8] = { /* "Hi There" */
        0x48,0x69,0x20,0x54,0x68,0x65,0x72,0x65
    };
    static const byte expected[32] = {
        0xb0,0x34,0x4c,0x61,0xd8,0xdb,0x38,0x53,
        0x5c,0xa8,0xaf,0xce,0xaf,0x0b,0xf1,0x2b,
        0x88,0x1d,0xc2,0x00,0xc9,0x83,0x3d,0xa7,
        0x26,0xe9,0x37,0x6c,0x2e,0x32,0xcf,0xf7
    };
    Hmac hmac;
    byte out[WC_SHA256_DIGEST_SIZE];
    int  ret;
    int  i;

    XMEMSET(out, 0, sizeof(out));

    ret = wc_HmacInit(&hmac, NULL, WC_DHUK_DEVID);
    if (ret == 0) {
        ret = wc_HmacSetKey(&hmac, WC_SHA256, key, (word32)sizeof(key));
    }
    if (ret == 0) {
        ret = wc_HmacUpdate(&hmac, data, (word32)sizeof(data));
    }
    if (ret == 0) {
        ret = wc_HmacFinal(&hmac, out);
    }
    wc_HmacFree(&hmac);
    if (ret != 0) {
        printf("  HMAC-SHA256 failed: %d\n", ret);
        return ret;
    }
    if (XMEMCMP(out, expected, sizeof(expected)) != 0) {
        printf("  HMAC-SHA256 vector mismatch -- FAIL\n  got:");
        for (i = 0; i < (int)sizeof(out); i++) printf(" %02x", out[i]);
        printf("\n");
        return -1;
    }
    printf("  HMAC-SHA256 matches RFC 4231 case 1 OK\n");
    return 0;
}
#endif /* !NO_HMAC */

#ifndef WC_NO_RNG
/* [4] TRNG via a DHUK-devId RNG. wc_RNG_GenerateBlock routes to the callback's
 * WC_ALGO_TYPE_RNG case, which drives the STM32 hardware RNG. Sanity-check that
 * the output is non-trivial (not all-zero, not all-identical bytes). */
static int test_cbonly_rng(void)
{
    WC_RNG rng;
    byte   buf[32];
    int    ret;
    int    i;
    int    allZero = 1;
    int    allSame = 1;

    XMEMSET(buf, 0, sizeof(buf));

    ret = wc_InitRng_ex(&rng, NULL, WC_DHUK_DEVID);
    if (ret != 0) {
        printf("  wc_InitRng_ex(DHUK) failed: %d\n", ret);
        return ret;
    }
    ret = wc_RNG_GenerateBlock(&rng, buf, (word32)sizeof(buf));
    wc_FreeRng(&rng);
    if (ret != 0) {
        printf("  TRNG generate failed: %d\n", ret);
        return ret;
    }
    for (i = 0; i < (int)sizeof(buf); i++) {
        if (buf[i] != 0x00) allZero = 0;
        if (buf[i] != buf[0]) allSame = 0;
    }
    if (allZero || allSame) {
        printf("  TRNG output degenerate (allZero=%d allSame=%d) -- FAIL\n",
               allZero, allSame);
        return -1;
    }
    printf("  TRNG produced %u bytes of entropy OK\n", (unsigned)sizeof(buf));
    return 0;
}
#endif /* !WC_NO_RNG */

#endif /* WOLFSSL_DHUK && (BARE||CUBEMX) && WC_STM32_HAS_DHUK && WOLF_CRYPTO_CB */

int main(void)
{
    int ret = 0;

    board_init();
    SystemCoreClockUpdate();

    printf("\n");
    printf("========================================\n");
    printf("wolfCrypt callback-only test - %s (CONFIG=%s)\n",
           board_name(), BUILD_CONFIG_NAME);
    printf("wolfSSL version: %s\n", LIBWOLFSSL_VERSION_STRING);
    printf("SYSCLK: expected %lu Hz, CMSIS-reported %lu Hz%s\n",
           (unsigned long)board_sysclk_hz(),
           (unsigned long)SystemCoreClock,
           ((unsigned long)SystemCoreClock == (unsigned long)board_sysclk_hz())
               ? " (match)" : " (MISMATCH -- PLL may have failed)");
    printf("========================================\n\n");

    ret = wolfCrypt_Init();
    if (ret != 0) {
        printf("wolfCrypt_Init failed: %d\n", ret);
        for (;;) { }
    }

#if defined(WOLFSSL_DHUK) && \
    (defined(WOLFSSL_STM32_BARE) || defined(WOLFSSL_STM32_CUBEMX)) && \
    defined(WC_STM32_HAS_DHUK) && defined(WOLF_CRYPTO_CB)
    {
        WC_RNG rng;
        int    rc;

        ret = wc_Stm32_DhukRegister(WC_DHUK_DEVID);
        if (ret != 0) {
            printf("wc_Stm32_DhukRegister failed: %d\n", ret);
            goto done;
        }

        ret = wc_InitRng(&rng);
        if (ret != 0) {
            printf("wc_InitRng failed: %d\n", ret);
            wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
            goto done;
        }

#if defined(HAVE_ECC) && defined(WOLFSSL_STM32_PKA)
        printf("[1] ECDSA sign(DHUK) + verify:\n");
        rc = test_cbonly_ecdsa(&rng);
        g_cbonly_res.ecdsa_rc = rc;
        if (rc != 0 && ret == 0) ret = rc;
#endif
#ifdef HAVE_AESGCM
        printf("\n[2] AES-GCM full payload (DHUK, SAES CTR + GHASH):\n");
        rc = test_cbonly_gcm();
        g_cbonly_res.gcm_rc = rc;
        if (rc != 0 && ret == 0) ret = rc;
#endif
#ifndef NO_HMAC
        printf("\n[3] HMAC-SHA256 (DHUK devId -> STM32 HASH block):\n");
        rc = test_cbonly_hmac();
        g_cbonly_res.hmac_rc = rc;
        if (rc != 0 && ret == 0) ret = rc;
#endif
#ifndef WC_NO_RNG
        printf("\n[4] TRNG via crypto-callback (DHUK devId):\n");
        rc = test_cbonly_rng();
        g_cbonly_res.rng_rc = rc;
        if (rc != 0 && ret == 0) ret = rc;
#endif

        wc_FreeRng(&rng);
        wc_Stm32_DhukUnRegister(WC_DHUK_DEVID);
    }
#else
    printf("callback-only not enabled in this build (need WOLFSSL_DHUK + "
           "WOLF_CRYPTO_CB + WOLFSSL_STM32_BARE + WC_STM32_HAS_DHUK).\n");
    ret = -1;
#endif

done:
    g_cbonly_res.overall = ret;
    g_cbonly_res.magic = 0xCB010001u;
    wolfCrypt_Cleanup();
    printf("\nResult: %d (%s)\n", ret, ret == 0 ? "PASS" : "FAIL");
    printf("Test complete\n");

    for (;;) { }
}
